Revit 2027 API
RevitCommandId.LookupPostableCommandId Method
 Looks up and retrieves the Revit command id with the given id string.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static RevitCommandId LookupPostableCommandId(
	PostableCommand postableCommand
)
Public Shared Function LookupPostableCommandId (
	postableCommand As PostableCommand
) As RevitCommandId
public:
static RevitCommandId^ LookupPostableCommandId(
	PostableCommand postableCommand
)
static member LookupPostableCommandId :
        postableCommand : PostableCommand -> RevitCommandId
Parameters
postableCommand PostableCommand
The postable command.
Return Value
RevitCommandId
 The Revit command id. Returning null if a command with the given name was not found.
Exceptions
Exception | Condition
ArgumentNullException | Thrown when name is null.
See Also
Reference
RevitCommandId Class
Autodesk.Revit.UI Namespace